package task.io;

public class ReadWriteFileExceptionHandling {
    public static void main(String[] args) {

    }

    // Реализуйте функциональность согласно описанию

    // TODO: Напишите программу, которая создает новый файл и записывает в него данные, которые передаются
    //  строкой

    // TODO: Напишите программу, в которой при запуске приложения вы вводите в консоль текст и на основе
    //  введенного текста создается файл

    // TODO: Создайте метод, который делит два числа и возвращает результат. Обработайте исключение,
    //  если второе число равно нулю , перехватите его(ArithmeticException) и выведите свое сообщение об ошибке с текстом
    //  "Деление на ноль запрещено"

    // TODO: Напишите программу, которая считывает число с клавиатуры и выводит его квадрат. Выбросите
    //  исключение, если введено не число

    // TODO: Создайте класс, который представляет банковский счет. Реализуйте метод для снятия денег со
    //  счета. Выбросите исключение, если на счете недостаточно средств.

    // TODO: Напишите программу, которая считывает данные из файла и выводит их на экран. Обработайте
    //  исключение, если файл не найден.

    // TODO: Создайте метод, который преобразует строку в число. Обработайте исключение, если строка не
    //  может быть преобразована в число.

    // TODO: Реализуйте класс, который представляет список студентов. Реализуйте метод для добавления
    //  студента в список. Выбросите исключение, если список уже содержит студента с таким же именем.

    // TODO:Напишите программу который принимает с консоли два значения делит одно на другое и обрабатывает исключение, если введены некорректные данные:
    //  к примеру с консоли передали строки , а строки делить друг на друга нельзя , тогда выбросите ошибку и напишите сообщение об этом в консоль

    // TODO: Создайте класс, который представляет автомобиль. Реализуйте метод для запуска двигателя.
    //  Выбросить исключение, если двигатель уже запущен.

    // TODO: Напишите программу, которая создает файл из текста, который подается строкой, а потом
    //  считывает первое слово из файла
}